Revit 2027 API
PartUtils.AreElementsValidForCreateParts Method
 Identifies if the given elements can be used to create parts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool AreElementsValidForCreateParts(
	Document document,
	ICollection<ElementId> elementIds
)
Public Shared Function AreElementsValidForCreateParts (
	document As Document,
	elementIds As ICollection(Of ElementId)
) As Boolean
public:
static bool AreElementsValidForCreateParts(
	Document^ document,
	ICollection<ElementId^>^ elementIds
)
static member AreElementsValidForCreateParts :
        document : Document *
        elementIds : ICollection<ElementId> -> bool
Parameters
document Document
 The document.
elementIds ICollection<ElementId>
 Element ids to be tested for validity for creating parts.
Return Value
Boolean
 True if all member ids are valid, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PartUtils Class
Autodesk.Revit.DB Namespace